choices_choose_ability = {
    "choose_choices":{
        "choose_ability":{
            "choices_detail":"โปรดเลือกทักษะพื้นฐานของตัวละครที่ช่อง Item",
            "condition": [
            ],
            "results": [
            ],
            "results_w_condition":[
            ],
            "choices": [
                {
                    "detail":"[ เริ่ม ]", 
                    "paths":[ 
                        [ [["แต้ม Ability", ">", 0]], "./index.html?choices=choose_ability_point_not_out"],
                        [ [["แต้ม Ability", "=", 0]], url_path("bd13952e7fb4941dd0cee6e9cee2b308")],
                    ],
                    "condition": [
                    ],
                    "results": [
                    ],
                    "results_w_condition":[
                        [ [["แต้ม Ability", "=", 0]], ["นักสู้มืออาชีพ", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] นักสู้มืออาชีพ", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["นักเจรจาต่อรอง", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] นักเจรจาต่อรอง", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["กลมกลืนกับสภาพแวดล้อม", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] กลมกลืนกับสภาพแวดล้อม", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["มือไว", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] มือไว", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["ตาเหยี่ยว", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] ตาเหยี่ยว", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["มือช่าง", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] มือช่าง", "=", 0]],
                    ],
                },
            ],
        },
        "choose_ability_point_not_out":{
            "choices_detail":"โปรดเลือกทักษะพื้นฐานของตัวละครที่ช่อง Item [\"โปรดใช้แต้ม Point ให้หมดก่อนเริ่ม\"]",
            "condition": [
            ],
            "results": [
            ],
            "results_w_condition":[
            ],
            "choices": [
                {
                    "detail":"[ เริ่ม ]", 
                    "paths":[ 
                        [ [["แต้ม Ability", ">", 0]], "./index.html?choices=choose_ability_point_not_out"],
                        [ [["แต้ม Ability", "=", 0]], url_path("bd13952e7fb4941dd0cee6e9cee2b308")],
                    ],
                    "condition": [
                    ],
                    "results": [
                    ],
                    "results_w_condition":[
                        [ [["แต้ม Ability", "=", 0]], ["นักสู้มืออาชีพ", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] นักสู้มืออาชีพ", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["นักเจรจาต่อรอง", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] นักเจรจาต่อรอง", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["กลมกลืนกับสภาพแวดล้อม", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] กลมกลืนกับสภาพแวดล้อม", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["มือไว", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] มือไว", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["ตาเหยี่ยว", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] ตาเหยี่ยว", "=", 0]],
                        
                        [ [["แต้ม Ability", "=", 0]], ["มือช่าง", "=", 0]],
                        [ [["แต้ม Ability", "=", 0]], ["[ปลด] มือช่าง", "=", 0]],
                    ],
                },
            ],
        },
    }
}